I see this issue when trying to create an HTTPS record (just to try it out).

```terraform
resource "cloudflare_dns_record" "https" {
  zone_id = cloudflare_zone.zone.id
  type    = "HTTPS"
  name    = "<name>"
  data = {
    priority = 1
    target   = "."
    value    = "alpn=\"h3,h2\""
  }
  ttl = 86400
}
```

Applying twice yields:

```
  ~ resource "cloudflare_dns_record" "https" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 . alpn=\"h3,h2\"" -> (known after apply)
      ~ created_on          = "2025-04-05T22:22:10Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + size           = 0
            # (3 unchanged attributes hidden)
        }
        id                  = "<id>"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-04-05T22:22:10Z" -> (known after apply)
        name                = "<name>"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }
```

As you can see, just like the others, it's trying to apply extra, unnecessary `data`.